MENSAGEM.UNIQUE=J\u00e1 existe esse registro!
OPERACAO_SUCESSO=Opera\u00e7\u00e3o realizada com sucesso!
MENSAGEM.FOREIGNKEY=Opera\u00e7\u00e3o n\u00e3o foi realizada completamente, pois existem dependentes desse registro!


#Transacoes Contabeis
TRANSACAO.NULA=Transa\u00e7\u00e3o n\u00e3o pode estar nula!
COMANDO.NULO=Comando n\u00e3o pode estar nulo!
NECESSARIO.SUPRIMENTO=Necess\u00e1rio um suprimento v\u00e1lido para realizar esta opera\u00e7\u00e3o!
NECESSARIO.SAIDA.PRODUTO=Necess\u00e1rio uma saida de produto v\u00e1lida para realizar esta opera\u00e7\u00e3o!
NECESSARIO.LISTA.PRODUTOS=Necess\u00e1rio uma lista de produtos para realizar esta opera\u00e7\u00e3o!
NECESSARIO.NATUREZA.SUPRIMENTO=Necess\u00e1rio uma natureza do suprimento v\u00e1lida para realizar esta opera\u00e7\u00e3o!
NECESSARIO.SOLICITACAO.PRODUTO=Necess\u00e1rio uma solicita\u00e7\u00e3o de produto para  realizar esta opera\u00e7\u00e3o!
NECESSARIO.SOLICITACAO.PRODUTO.CONSIGNADO=Necess\u00e1rio uma solicita\u00e7\u00e3o de produto consignado para  realizar esta opera\u00e7\u00e3o!
OPERACAO.INVALIDA.NATUREZA=Opera\u00e7\u00e3o inv\u00e1lida para esta natureza de suprimento!
NECESSARIO.AJUSTE.INVENTARIO=Necess\u00e1rio uma ajuste  de invent\u00e1rio para realizar esta opera\u00e7\u00e3o! 

#Suprimento
NECESSARIA.APROPRIACAO=Pelo menos uma apropria\u00e7\u00e3o deve ser adicionada para esta natureza!
FORNECEDOR.NULO.SUPRIMENTO=Fornecedor deve estar preenchido para esta opera\u00e7\u00e3o!
LOCAL.DISTRIBUICAO.NULO.SUPRIMENTO=Preencha os locais de distribui\u00e7\u00e3o corretamente!
NECESSARIO.PLANO.CONTA.DESPESA = Necess\u00e1ria uma conta despesa para esta opera\u00e7\u00e3o!
TOTAL.FATURA.DIVERGENTE=Total da soma dos valores das faturas n\u00e3o confere com o total da nota!
TOTAL.APROPRIACAO_NUCLEO.DIVERGENTE=Total da soma dos valores da apropria\u00e7\u00e3o difere do total da nota!
TOTAL.APROPRIACAO.CONTA.DIVERGENTE=Total da soma dos valores do rateio de contas difere do total da nota!
TOTAL.PRODUTO.DIVERGENTE=Total da soma dos valores dos produtos difere do total da nota!
PROIBIDA.APLICACAO.DIRETA.PRODUTO.PACIENTE=Existem produtos com sa\u00EDda obrigat\u00f3ria para paciente portanto a natureza n\u00e3o pode ser aplica\u00e7\u00e3o direta!
ESTOQUE.INSUFICIENTE=Total em estoque n\u00e3o \u00e9 suficiente para transfer\u00eancia de um destes produtos!
LOCAL.DISTRIBUICAO.IGUAL=Para transfer\u00eancia de produtos s\u00e3o necess\u00e1rios locais de distribui\u00e7\u00e3o diferentes!
NECESSARIO.PRODUTO=Pelo menos um produto deve estar adicionado!

#Contabil
PERIODO.CONTABIL.FECHADO=Per\u00edodo cont\u00e1bil fechado para esta data!

#Geral
MEDICAMENTO.APRAZADO=Medicamento j\u00e1 foi aprazado impedindo essa opera\u00e7\u00e3o!